Revit 2027 API
ParameterTypeId.FabricParamMajorLapspliceLength Property
 "Major Lap Splice Length": Fabric lap splice length in major direction in the fabric distribution.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FabricParamMajorLapspliceLength { get; }
Public Shared ReadOnly Property FabricParamMajorLapspliceLength As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FabricParamMajorLapspliceLength {
	ForgeTypeId^ get ();
}
static member FabricParamMajorLapspliceLength : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace